Revit 2027 API
IDropHandler.Execute Method
 Implement this method to handle the drop event for your data.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Execute(
	UIDocument document,
	Object data
)
Sub Execute (
	document As UIDocument,
	data As Object
)
void Execute(
	UIDocument^ document,
	Object^ data
)
abstract Execute :
        document : UIDocument *
        data : Object -> unit
Parameters
document UIDocument
The document on which the data was dropped.
data Object
The data.
See Also
Reference
IDropHandler Interface
Autodesk.Revit.UI Namespace